# HTML теги


Напишите программу, которая находит во фрагменте HTML-страницы все атрибуты каждого тега.

**Формат входных данных**

На вход программе подается произвольное количество строк, которые образуют фрагмент HTML-страницы.

**Формат выходных данных**

Программа должна найти в введенном фрагменте HTML-страницы все теги и вывести их, указав для каждого соответствующие атрибуты. Теги вместе со всеми атрибутами должны быть расположены каждый на отдельной строке, в следующем формате:

`<тег>: <атрибут>, <атрибут>, ...`

Теги, а также атрибуты тегов, должны быть расположены в лексикографическом порядке.

Тестовые данные доступны по ссылке - https://github.com/python-generation/Professional/tree/main/Module_11/Module_11.7/Module_11.7.17<br>
Ссылка на задачу на площадке - https://stepik.org/lesson/680265/step/17?unit=678923

## Решение
```
from re import *
from collections import defaultdict

d = defaultdict(set)
for i in open(0):
    for j in i.split('>'):
        match = search(r'<(\w+)', j)
        if match:
            d[match.group(1)].update(set(findall(r'\s([^ ]+?)=', j)))

for key, value in sorted(d.items()):
    print(f'{key}: {", ".join(sorted(value))}')
```