# Заполнение спиралью

На вход программе подаются два натуральных числа n и m
Напишите программу, которая создает матрицу размером n×m, заполнив ее "спиралью" в соответствии с образцом.

**Формат входных данных**

На вход программе на одной строке подаются два натуральных числа n и m – количество строк и столбцов в матрице.

**Формат выходных данных**

Программа должна вывести матрицу в соответствии образцом.

**Примечание.** Для вывода элементов матрицы как в примерах отводите ровно 3 символа на каждый элемент. Для этого используйте строковый метод `ljust()`. Можно обойтись и без `ljust()`, система примет и такое решение.


Ссылка на задачу на площадке - https://stepik.org/lesson/416757/step/10?discussion=4298380&unit=406265

Тестовые данные:

**Sample Input 1:**

4 5

**Sample Output 1:**

1&nbsp;&nbsp;  2&nbsp;&nbsp;  3&nbsp;&nbsp;  4&nbsp;&nbsp;  5<br>
14 15 16 17 6<br>
13 20 19 18 7<br>
12 11 10 9&nbsp;&nbsp;  8<br>

**Sample Input 2:**

1 6

**Sample Output 2:**

1  2  3  4  5  6

**Sample Input 3:**

3 3

**Sample Output 3:**

1  2  3<br>
8  9  4<br>
7  6  5<br>

## Решение
```
from math import ceil
n, m = [int(i) for i in input().split()]
matrix = [['*'] * m for _ in range(n)]
count = 0

# 1 ЧАСТЬ 1

r = m
s = 0

for i in range(ceil(n/2)):
    for j in range(s,r-1):
        matrix[i][j] = count + 1
        count += 1
    count += r-s-3+2*(n-2*s)  
    r -= 1
    s += 1
    
# 2 ЧАСТЬ 2

r = n 
s = 0
f = m-1
count = m-1
for j in range(m-1, m//2-1, -1):
    for i in range(s, r):
        matrix[i][j] = count + 1
        count += 1
    count += f 
    r -= 1
    f -= 2
    s += 1
    count += f +(n-2*s) 
    
# 3 ЧАСТЬ 3

r = m
s = 0
f = n-1
d = m-1
count = m+n-2
for i in range(n-1, ceil(n/2)-1, -1):
    for j in range(r-1, s, -1):
        matrix[i][j] = count + 1
        count += 1
    count += f
    f -= 2
    r -= 1
    s += 1   
    d -= 2
    count += f+d
    
# 4 ЧАСТЬ 4
    
r = n
s = 0
d = m-1
f = n-1
count = 2*m+n-3
for j in range(s, m//2):
    for i in range(r-1, s, -1):
        matrix[i][j] = count + 1
        count += 1
    f -= 2   
    r -= 1
    s += 1
    d -= 2
    count += 2*d+f
for i in range(n):
    for j in range(m):
        print(str(matrix[i][j]).ljust(3), end=' ')
    print()
```